Revit 2024 API
FabricationPart.PartGuid Property
 The fabrication part's globally unique identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public Guid PartGuid { get; }
Visual Basic
Public ReadOnly Property PartGuid As Guid
	Get
Visual C++
public:
property Guid PartGuid {
	Guid get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace